---
type: IExportContextBase
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# IExportContextBase

`Autodesk.Revit.DB.IExportContextBase` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnCurve | — | `RenderNodeAction OnCurve ( CurveNode node )` |
| Method | OnLineSegment | — | `void OnLineSegment ( LineSegment segment )` |
| Method | OnPolyline | — | `RenderNodeAction OnPolyline ( PolylineNode node )` |
| Method | OnPolylineSegments | — | `void OnPolylineSegments ( PolylineSegments segments )` |
| Method | OnText | — | `void OnText ( TextNode node )` |